---
kind: type
id: T:Autodesk.Revit.DB.FormArray
source: html/24506527-802b-2487-919e-14a4a06f60be.htm
---
# Autodesk.Revit.DB.FormArray

An array that contains form objects.

## Syntax (C#)
```csharp
public class FormArray : APIObject, IEnumerable
```